app/controllers/articles_controller.rb

	def create
		@article = Article.new(article_params)

	  if @article.save
---
INSERT INTO `articles` (`created_at`, `text`, `title`, `updated_at`) VALUES ('2014-07-08 15:25:04', 'ddsff', '12345', '2014-07-08 15:25:04')

	def show
	  @article = Article.find(params[:id])
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 ORDER BY `articles`.`id` ASC LIMIT 1