app/controllers/comments_controller.rb

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
INSERT INTO `comments` (`article_id`, `body`, `commenter`, `created_at`, `updated_at`) VALUES (1, '', '', '2014-07-08 15:25:09', '2014-07-08 15:25:09')
---
  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)